void main(List<String> args) {
  //1-задача
  int a1 = 11;
  if (a1 == 10) {
    print("Верно");
  } else {
    print("Неверно");
  }
  //2-задача
  int a2 = -3;
  if (a2 == 0) {
    print("Верно");
  } else {
    print("Неверно");
  }
  //при а2=1  ответ:Неверно
  //при а2=0  ответ:Верно
  //при а2=-3 ответ:Неверно

  //3-задача
  int a3 = -3;
  if (a3 > 0) {
    print("Верно");
  } else {
    print("Неверно");
  }
  //при а3=1  ответ:Верно
  //при а3=0  ответ:Неверно
  //при а3=-3 ответ:Неверно

  //4-задача
  int a4 = -3;
  if (a4 < 0) {
    print("Верно");
  } else {
    print("Неверно");
  }
  //при а4=1  ответ:Неверно
  //при а4=0  ответ:Неверно
  //при а4=-3 ответ:Верно

  //5-задача
  int a5 = -3;
  if (a5 >= 0) {
    print("Верно");
  } else {
    print("Неверно");
  }
  //при а5=1  ответ:Верно
  //при а5=0  ответ:Верно
  //при a5=-3 ответ:Неверно

  //6-задача
  int a6 = -3;
  if (a6 <= 0) {
    print("Верно");
  } else {
    print("Неверно");
  }
  //при а6=1  ответ:Неверно
  //при а6=0  ответ:Верно
  //при a6=-3 ответ:Верно

  //7-задача
  int a7 = -3;
  if (a7 != 0) {
    print("Верно");
  } else {
    print("Неверно");
  }
  //при а7=1  ответ:Верно
  //при а7=0  ответ:Неверно
  //при a7=-3 ответ:Верно

  //8-задача
  var a8;
  a8 = 3;
  if (a8 == "test") {
    print("Верно");
  } else {
    print("Неверно");
  }
  //при а8="test"  ответ:Верно
  //при а8="тест"  ответ:Неверно
  //при a8=3       ответ:Неверно

  //9-задача
  var a9;
  a9 = 1;
  if (a9 == "1" && a9.runtimeType == String) {
    print("Верно");
  } else {
    print("Неверно");
  }
  //при а9="1" ответ:Верно
  //при а9=1   ответ:Неверно
  //при a9=3   ответ:Неверно
}
